zephyrproject-rtos/zephyr/drivers/serial/uart_stm32.c
/*
 * Copyright (c) 2016 Open-RnD Sp. z o.o.
 * Copyright (c) 2016 Linaro Limited.
 * Copyright (c) 2024 STMicroelectronics
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT st_stm32_uart

/**
 * @brief Driver for UART port on STM32 family processor.
 * @note  LPUART and U(S)ART have the same base and
 *        majority of operations are performed the same way.
 *        Please validate for newly added series.
 */

#include <zephyr/kernel.h>
#include <zephyr/arch/cpu.h>
#include <zephyr/sys/__assert.h>
#include <soc.h>
#include <stm32_bitops.h>
#include <stm32_cache.h>
#include <zephyr/init.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/pm/policy.h>
#include <zephyr/pm/device.h>

#ifdef CONFIG_UART_ASYNC_API
#include <zephyr/drivers/dma/dma_stm32.h>
#include <zephyr/drivers/dma.h>
#endif

#include <zephyr/linker/sections.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include "uart_stm32.h"

#include <stm32_ll_bus.h>
#include <stm32_ll_usart.h>
#include <stm32_ll_lpuart.h>
#if defined(CONFIG_PM) && defined(IS_UART_WAKEUP_FROMSTOP_INSTANCE)
#include <stm32_ll_pwr.h>
#include <zephyr/drivers/interrupt_controller/intc_exti_stm32.h>
#endif /* CONFIG_PM */

#include <zephyr/linker/linker-defs.h>
#include <zephyr/mem_mgmt/mem_attr.h>
#include <zephyr/dt-bindings/memory-attr/memory-attr-arm.h>

#include <zephyr/logging/log.h>
#include <zephyr/irq.h>
LOG_MODULE_REGISTER(uart_stm32, CONFIG_UART_LOG_LEVEL);

#if defined(CONFIG_STM32_HAL2)
#define STM32_USART_STOP_BIT_0_5	LL_USART_STOP_BIT_0_5
#define STM32_USART_STOP_BIT_1		LL_USART_STOP_BIT_1
#define STM32_USART_STOP_BIT_1_5	LL_USART_STOP_BIT_1_5
#define STM32_USART_STOP_BIT_2		LL_USART_STOP_BIT_2

#define STM32_USART_DATAWIDTH_7_BIT	LL_USART_DATAWIDTH_7_BIT
#define STM32_USART_DATAWIDTH_8_BIT	LL_USART_DATAWIDTH_8_BIT
#define STM32_USART_DATAWIDTH_9_BIT	LL_USART_DATAWIDTH_9_BIT

#define STM32_USART_DIV_SAMPLING16	LL_USART_DIV_SAMPLING16

#define STM32_LPUART_PRESCALER_TAB	LL_LPUART_PRESCALER_TAB
#define STM32_LPUART_LPUARTDIV_FREQ_MUL	LL_LPUART_LPUARTDIV_FREQ_MUL
#define STM32_LPUART_BRR_MIN_VALUE	LL_LPUART_BRR_MIN_VALUE
#define STM32_LPUART_BRR_MASK		LL_LPUART_BRR_MASK
#else /* CONFIG_STM32_HAL2 */
#ifdef LL_USART_STOPBITS_0_5
#define STM32_USART_STOP_BIT_0_5	LL_USART_STOPBITS_0_5
#endif /* LL_USART_STOPBITS_0_5 */
#define STM32_USART_STOP_BIT_1		LL_USART_STOPBITS_1
#ifdef LL_USART_STOPBITS_1_5
#define STM32_USART_STOP_BIT_1_5	LL_USART_STOPBITS_1_5
#endif /* STM32_USART_STOP_BIT_1 */
#define STM32_USART_STOP_BIT_2		LL_USART_STOPBITS_2

#ifdef LL_USART_DATAWIDTH_7B
#define STM32_USART_DATAWIDTH_7_BIT	LL_USART_DATAWIDTH_7B
#endif /* LL_USART_DATAWIDTH_7B */
#define STM32_USART_DATAWIDTH_8_BIT	LL_USART_DATAWIDTH_8B
#ifdef LL_USART_DATAWIDTH_9B
#define STM32_USART_DATAWIDTH_9_BIT	LL_USART_DATAWIDTH_9B
#endif /* LL_USART_DATAWIDTH_9B */

#define STM32_USART_DIV_SAMPLING16	__LL_USART_DIV_SAMPLING16

#define STM32_LPUART_PRESCALER_TAB	LPUART_PRESCALER_TAB
#define STM32_LPUART_LPUARTDIV_FREQ_MUL	LPUART_LPUARTDIV_FREQ_MUL
#define STM32_LPUART_BRR_MIN_VALUE	LPUART_BRR_MIN_VALUE
#define STM32_LPUART_BRR_MASK		LPUART_BRR_MASK
#endif /* CONFIG_STM32_HAL2 */

/* This symbol takes the value 1 if one of the device instances */
/* is configured in dts with a domain clock */
#if STM32_DT_INST_DEV_DOMAIN_CLOCK_SUPPORT
#define STM32_UART_DOMAIN_CLOCK_SUPPORT 1
#else
#define STM32_UART_DOMAIN_CLOCK_SUPPORT 0
#endif

#define HAS_LPUART DT_HAS_COMPAT_STATUS_OKAY(st_stm32_lpuart)

/* Available everywhere except l1, f1, f2, f4. */
#ifdef USART_CR3_DEM
#define HAS_DRIVER_ENABLE 1
#else
#define HAS_DRIVER_ENABLE 0
#endif

/* Helper for checking if we can use hardware receive timeouts
 * instead of the work queue on a given UART
 */
#ifdef USART_RTOR_RTO
#define HAS_RTO 1
#else
#define HAS_RTO 0
#endif

#ifdef CONFIG_PM
/* Placeholder value when wakeup-line DT property is not defined */
#define STM32_WAKEUP_LINE_NONE	0xFFFFFFFF
#endif

#if HAS_LPUART
#ifdef USART_PRESC_PRESCALER
uint32_t lpuartdiv_calc(const uint64_t clock_rate, const uint16_t presc_idx,
			const uint32_t baud_rate)
{
	uint64_t lpuartdiv;

	lpuartdiv = clock_rate / STM32_LPUART_PRESCALER_TAB[presc_idx];
	lpuartdiv *= STM32_LPUART_LPUARTDIV_FREQ_MUL;
	lpuartdiv += baud_rate / 2;
	lpuartdiv /= baud_rate;

	return (uint32_t)lpuartdiv;
}
#else
uint32_t lpuartdiv_calc(const uint64_t clock_rate, const uint32_t baud_rate)
{
	uint64_t lpuartdiv;

	lpuartdiv = clock_rate * STM32_LPUART_LPUARTDIV_FREQ_MUL;
	lpuartdiv += baud_rate / 2;
	lpuartdiv /= baud_rate;

	return (uint32_t)lpuartdiv;
}
#endif /* USART_PRESC_PRESCALER */
#endif /* HAS_LPUART */

#if defined(CONFIG_PM) && defined(IS_UART_WAKEUP_FROMSTOP_INSTANCE)
static void uart_stm32_pm_enable_wakeup_line(uint32_t wakeup_line)
{
#if defined(CONFIG_SOC_SERIES_STM32WB0X)
	ARG_UNUSED(wakeup_line);
#if defined(PWR_CR3_EIWL2)
	/**
	 * If SoC is equipped with LPUART instance,
	 * enable the associated wake-up line in PWRC.
	 */
	LL_PWR_EnableInternWU2();
#endif /* PWR_CR3_EIWL2 */
#else
	if (wakeup_line != STM32_WAKEUP_LINE_NONE) {
		/* Enable EXTI line associated to UART wake-up event */
		stm32_exti_enable(wakeup_line, STM32_EXTI_TRIG_NONE, STM32_EXTI_MODE_IT);
	}
#endif /* CONFIG_SOC_SERIES_STM32WB0X */
}
#endif /* CONFIG_PM && IS_UART_WAKEUP_FROMSTOP_INSTANCE */

#ifdef CONFIG_PM
static void uart_stm32_pm_policy_state_lock_get_unconditional(void)
{
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	if (IS_ENABLED(CONFIG_PM_S2RAM)) {
		pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_RAM, PM_ALL_SUBSTATES);
	}
}

static void uart_stm32_pm_policy_state_lock_get(const struct device *dev)
{
	struct uart_stm32_data *data = dev->data;

	if (!data->pm_policy_state_on) {
		data->pm_policy_state_on = true;
		uart_stm32_pm_policy_state_lock_get_unconditional();
	}
}

static void uart_stm32_pm_policy_state_lock_put_unconditional(void)
{
	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	if (IS_ENABLED(CONFIG_PM_S2RAM)) {
		pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_RAM, PM_ALL_SUBSTATES);
	}
}

