zephyrproject-rtos/zephyr/drivers/serial/uart_stm32.c
static void uart_stm32_pm_policy_state_lock_put(const struct device *dev)
{
	struct uart_stm32_data *data = dev->data;

	if (data->pm_policy_state_on) {
		data->pm_policy_state_on = false;
		uart_stm32_pm_policy_state_lock_put_unconditional();
	}
}

#ifdef CONFIG_UART_ASYNC_API
static __maybe_unused void uart_stm32_rx_wakeup_lock_get(const struct device *dev)
{
	struct uart_stm32_data *data = dev->data;

	if (!data->rx_woken) {
		data->rx_woken = true;
		uart_stm32_pm_policy_state_lock_get_unconditional();
	}
}

static __maybe_unused void uart_stm32_rx_wakeup_lock_put(const struct device *dev)
{
	struct uart_stm32_data *data = dev->data;

	if (data->rx_woken) {
		data->rx_woken = false;
		uart_stm32_pm_policy_state_lock_put_unconditional();
	}
}
#endif /* CONFIG_UART_ASYNC_API */
#endif /* CONFIG_PM */

static inline int uart_stm32_set_baudrate(const struct device *dev, uint32_t baud_rate)
{
	const struct uart_stm32_config *config = dev->config;
	USART_TypeDef *usart = config->usart;

	if (baud_rate == 0) {
		return -EINVAL;
	}

	uint32_t clock_rate;

	/* Get clock rate */
	if (IS_ENABLED(STM32_UART_DOMAIN_CLOCK_SUPPORT) && (config->pclk_len > 1)) {
		int ret = clock_control_get_rate(config->clock,
						 (clock_control_subsys_t)&config->pclken[1],
						 &clock_rate);
		if (ret < 0) {
			LOG_ERR("Failed call clock_control_get_rate(pclken[1])");
			return ret;
		}
	} else {
		int ret = clock_control_get_rate(config->clock,
						 (clock_control_subsys_t)&config->pclken[0],
						 &clock_rate);
		if (ret < 0) {
			LOG_ERR("Failed call clock_control_get_rate(pclken[0])");
			return ret;
		}
	}

#if HAS_LPUART
	if (IS_LPUART_INSTANCE(usart)) {
		uint32_t lpuartdiv;
#ifdef USART_PRESC_PRESCALER
		uint8_t presc_idx;
		uint32_t presc_val;

		for (presc_idx = 0; presc_idx < ARRAY_SIZE(STM32_LPUART_PRESCALER_TAB);
		     presc_idx++) {
			lpuartdiv = lpuartdiv_calc(clock_rate, presc_idx, baud_rate);
			if (lpuartdiv >= STM32_LPUART_BRR_MIN_VALUE &&
			    lpuartdiv <= STM32_LPUART_BRR_MASK) {
				break;
			}
		}

		if (presc_idx == ARRAY_SIZE(STM32_LPUART_PRESCALER_TAB)) {
			LOG_ERR("Unable to set %s to %d", dev->name, baud_rate);
			return -EINVAL;
		}

		presc_val = presc_idx << USART_PRESC_PRESCALER_Pos;

		LL_LPUART_SetPrescaler(usart, presc_val);
#else
		lpuartdiv = lpuartdiv_calc(clock_rate, baud_rate);
		if (lpuartdiv < STM32_LPUART_BRR_MIN_VALUE || lpuartdiv > STM32_LPUART_BRR_MASK) {
			LOG_ERR("Unable to set %s to %d", dev->name, baud_rate);
			return -EINVAL;
		}
#endif /* USART_PRESC_PRESCALER */
		LL_LPUART_SetBaudRate(usart,
				      clock_rate,
#ifdef USART_PRESC_PRESCALER
				      presc_val,
#endif
				      baud_rate);
		/* Check BRR is greater than or equal to 0x300 */
		__ASSERT(stm32_reg_read(&usart->BRR) >= 0x300U, "BaudRateReg >= 0x300");

		/* Check BRR is lower than or equal to 0xFFFFF */
		__ASSERT(stm32_reg_read(&usart->BRR) < 0x000FFFFFU, "BaudRateReg < 0xFFFF");
	} else {
#endif /* HAS_LPUART */
#ifdef USART_CR1_OVER8
		LL_USART_SetOverSampling(usart,
					 LL_USART_OVERSAMPLING_16);
#endif

		uint32_t usartdiv = STM32_USART_DIV_SAMPLING16(clock_rate,
#ifdef USART_PRESC_PRESCALER
							       LL_USART_PRESCALER_DIV1,
#endif
							       baud_rate);
		if (usartdiv < 16) {
			LOG_ERR("Unable to set %s to %d", dev->name, baud_rate);
			return -EINVAL;
		}

		LL_USART_SetBaudRate(usart,
				     clock_rate,
#ifdef USART_PRESC_PRESCALER
				     LL_USART_PRESCALER_DIV1,
#endif
#ifdef USART_CR1_OVER8
				     LL_USART_OVERSAMPLING_16,
#endif
				     baud_rate);
		/* Check BRR is greater than or equal to 16d */
		__ASSERT(stm32_reg_read(&usart->BRR) >= 16, "BaudRateReg >= 16");

#if HAS_LPUART
	}
#endif /* HAS_LPUART */

	return 0;
}

static inline void uart_stm32_set_parity(const struct device *dev,
					 uint32_t parity)
{
	const struct uart_stm32_config *config = dev->config;

	LL_USART_SetParity(config->usart, parity);
}

static inline uint32_t uart_stm32_get_parity(const struct device *dev)
{
	const struct uart_stm32_config *config = dev->config;

	return LL_USART_GetParity(config->usart);
}

static inline void uart_stm32_set_stopbits(const struct device *dev,
					   uint32_t stopbits)
{
	const struct uart_stm32_config *config = dev->config;

	LL_USART_SetStopBitsLength(config->usart, stopbits);
}

static inline uint32_t uart_stm32_get_stopbits(const struct device *dev)
{
	const struct uart_stm32_config *config = dev->config;

	return LL_USART_GetStopBitsLength(config->usart);
}

static inline void uart_stm32_set_databits(const struct device *dev,
					   uint32_t databits)
{
	const struct uart_stm32_config *config = dev->config;

	LL_USART_SetDataWidth(config->usart, databits);
}

static inline uint32_t uart_stm32_get_databits(const struct device *dev)
{
	const struct uart_stm32_config *config = dev->config;

	return LL_USART_GetDataWidth(config->usart);
}

static inline void uart_stm32_set_hwctrl(const struct device *dev,
					 uint32_t hwctrl)
{
	const struct uart_stm32_config *config = dev->config;

#if defined(CONFIG_UART_STM32_ABNORMAL_RTS_ERRATUM_WORKAROUND)
	if (config->rts_gpio.port != NULL && hwctrl == LL_USART_HWCONTROL_RTS_CTS) {
		hwctrl = LL_USART_HWCONTROL_CTS;
	}
#endif

	LL_USART_SetHWFlowCtrl(config->usart, hwctrl);
}

static inline uint32_t uart_stm32_get_hwctrl(const struct device *dev)
{
	const struct uart_stm32_config *config = dev->config;
	uint32_t hwctrl = LL_USART_GetHWFlowCtrl(config->usart);

#if defined(CONFIG_UART_STM32_ABNORMAL_RTS_ERRATUM_WORKAROUND)
	if (config->rts_gpio.port != NULL && hwctrl == LL_USART_HWCONTROL_CTS) {
		hwctrl = LL_USART_HWCONTROL_RTS_CTS;
	}
#endif

	return hwctrl;
}

#if HAS_DRIVER_ENABLE
static inline void uart_stm32_set_driver_enable(const struct device *dev,
						bool driver_enable)
{
	const struct uart_stm32_config *config = dev->config;

	if (driver_enable) {
		LL_USART_EnableDEMode(config->usart);
	} else {
		LL_USART_DisableDEMode(config->usart);
	}
}

static inline bool uart_stm32_get_driver_enable(const struct device *dev)
{
	const struct uart_stm32_config *config = dev->config;

