zephyrproject-rtos/zephyr/drivers/serial/uart_stm32.c
#if defined(CONFIG_UART_INTERRUPT_DRIVEN) || \
	defined(CONFIG_UART_ASYNC_API) || \
	defined(CONFIG_PM)

static void uart_stm32_isr(const struct device *dev)
{
	struct uart_stm32_data *data = dev->data;
#if defined(CONFIG_PM) || defined(CONFIG_UART_ASYNC_API)
	const struct uart_stm32_config *config = dev->config;
	USART_TypeDef *usart = config->usart;

	/*
	 * The TC flag is checked several times in this ISR
	 * but it may change in the background while we're
	 * handling the IRQ. Read the flag once and perform
	 * checks against this cached value instead, such that
	 * the whole ISR sees the same status regardless of
	 * any hardware event that may happen.
	 */
	bool tx_complete = LL_USART_IsEnabledIT_TC(usart) && LL_USART_IsActiveFlag_TC(usart);
#endif

#ifdef CONFIG_PM
	if (tx_complete) {
		if (data->tx_poll_stream_on) {
			/* A poll stream transmission just completed,
			 * allow system to suspend
			 */
			LL_USART_DisableIT_TC(usart);
			data->tx_poll_stream_on = false;
			uart_stm32_pm_policy_state_lock_put(dev);
			/* This TC belonged to the poll stream and is now handled.
			 * Clear it so the async branch below does not treat it as
			 * an async TX completion and release the PM constraint a
			 * second time, which underflows the policy lock count.
			 */
			tx_complete = false;
		}
		/* Stream transmission was either async or IRQ based,
		 * constraint will be released at the same time TC IT
		 * is disabled
		 */
	}
#endif

#ifdef CONFIG_UART_INTERRUPT_DRIVEN
	if (data->user_cb) {
		data->user_cb(dev, data->user_data);
	}
#endif /* CONFIG_UART_INTERRUPT_DRIVEN */

#if defined(CONFIG_PM) && defined(IS_UART_WAKEUP_FROMSTOP_INSTANCE) \
	&& defined(USART_CR3_WUFIE)
	if (LL_USART_IsEnabledIT_WKUP(usart) &&
		LL_USART_IsActiveFlag_WKUP(usart)) {

		LL_USART_ClearFlag_WKUP(usart);

#ifdef CONFIG_UART_ASYNC_API
		/* Prevent SoC from entering STOP mode until RX goes IDLE */
		uart_stm32_rx_wakeup_lock_get(dev);
#endif

#ifdef USART_ISR_REACK
		while (LL_USART_IsActiveFlag_REACK(usart) == 0) {
		}
#endif
	}
#endif

#ifdef CONFIG_UART_ASYNC_API
#ifdef CONFIG_UART_INTERRUPT_DRIVEN
	/* If both ASYNC and INTERRUPT modes are supported in this build,
	 * check whether this instance is currently being used via the
	 * interrupt-driven API. If it is, do not process interrupt flags
	 * as the user callback invoked earlier is responsible for that.
	 */
	if (data->user_cb) {
		return;
	}
#endif /* CONFIG_UART_INTERRUPT_DRIVEN */

	if (LL_USART_IsEnabledIT_IDLE(usart) && LL_USART_IsActiveFlag_IDLE(usart)) {

		LL_USART_ClearFlag_IDLE(usart);

		LOG_DBG("idle interrupt occurred");

#ifdef CONFIG_PM
		/* Allow SoC to enter STOP mode now that RX is IDLE */
		uart_stm32_rx_wakeup_lock_put(dev);
#endif

		if (data->dma_rx.timeout == 0) {
			uart_stm32_dma_rx_flush(dev);
		} else {
			/* Start the RX timer not null */
			async_timer_start(&data->dma_rx.timeout_work,
								data->dma_rx.timeout);
		}
	} else if (tx_complete) {
		LL_USART_DisableIT_TC(usart);
		/* Generate TX_DONE event when transmission is done */
		async_evt_tx_done(data);
#ifdef CONFIG_PM
		uart_stm32_pm_policy_state_lock_put_unconditional();
#endif
	} else if (ll_usart_is_enabled_rxne(usart) && ll_usart_is_active_rxne(usart)) {
#ifdef USART_SR_RXNE
		/* clear the RXNE flag, because Rx data was not read */
		LL_USART_ClearFlag_RXNE(usart);
#else
		/* clear the RXNE by flushing the fifo, because Rx data was not read */
		LL_USART_RequestRxDataFlush(usart);
#endif /* USART_SR_RXNE */
#if HAS_RTO
	} else if (LL_USART_IsEnabledIT_RTO(usart) && LL_USART_IsActiveFlag_RTO(usart)) {

		LOG_DBG("rx timeout interrupt occurred");

		LL_USART_ClearFlag_RTO(usart);
#ifdef CONFIG_PM
		/* Allow SoC to enter STOP mode now that RX has timed out */
		uart_stm32_rx_wakeup_lock_put(dev);
#endif
		uart_stm32_dma_rx_flush(dev);
#endif /* HAS_RTO */
	}

	/* Clear errors */
	uart_stm32_err_check(dev);
#endif /* CONFIG_UART_ASYNC_API */

}
#endif /* CONFIG_UART_INTERRUPT_DRIVEN || CONFIG_UART_ASYNC_API || CONFIG_PM */

#ifdef CONFIG_UART_ASYNC_API

static int uart_stm32_async_callback_set(const struct device *dev,
					 uart_callback_t callback,
					 void *user_data)
{
	struct uart_stm32_data *data = dev->data;
	unsigned int key = irq_lock();

	data->async_cb = callback;
	data->async_user_data = user_data;

#if defined(CONFIG_UART_EXCLUSIVE_API_CALLBACKS)
	data->user_cb = NULL;
	data->user_data = NULL;
#endif

	irq_unlock(key);

	return 0;
}

static inline void uart_stm32_dma_tx_enable(const struct device *dev)
{
	const struct uart_stm32_config *config = dev->config;

	LL_USART_EnableDMAReq_TX(config->usart);
}

static inline void uart_stm32_dma_tx_disable(const struct device *dev)
{
#ifdef CONFIG_UART_STM32U5_ERRATA_DMAT_NOCLEAR
	ARG_UNUSED(dev);

	/*
	 * Errata Sheet ES0499 : STM32U575xx and STM32U585xx device errata
	 * USART does not generate DMA requests after setting/clearing DMAT bit
	 * (also seen on stm32H5 series)
	 */
#else
	const struct uart_stm32_config *config = dev->config;

	LL_USART_DisableDMAReq_TX(config->usart);
#endif
}

static inline void uart_stm32_dma_rx_enable(const struct device *dev)
{
	const struct uart_stm32_config *config = dev->config;
	struct uart_stm32_data *data = dev->data;
	USART_TypeDef *usart = config->usart;

#ifdef CONFIG_UART_STM32U5_ERRATA_DMAT_AFFECTED
	/*
	 * Workaround for STM32H5/U5: USART does not generate DMA requests
	 * after clearing/setting DMAR. This issue is not documented in the
	 * errata but behaves similarly to the documented DMAT issue.
	 * Toggle UE (USART Enable) to reset the USART internal state machine
	 * before re-enabling DMAR.
	 */
	LL_USART_Disable(usart);
	LL_USART_Enable(usart);
	/* Wait for USART to be ready after re-enable */
	while (!LL_USART_IsActiveFlag_TEACK(usart)) {
		/* busy-wait for transmit enable acknowledge */
	}
#endif /* CONFIG_UART_STM32U5_ERRATA_DMAT_AFFECTED */

	LL_USART_EnableDMAReq_RX(usart);
	data->dma_rx.enabled = true;
}

static inline void uart_stm32_dma_rx_disable(const struct device *dev)
{
	const struct uart_stm32_config *config = dev->config;
	struct uart_stm32_data *data = dev->data;

	LL_USART_DisableDMAReq_RX(config->usart);

	data->dma_rx.enabled = false;
}

static int uart_stm32_async_rx_disable(const struct device *dev)
{
	const struct uart_stm32_config *config = dev->config;
	USART_TypeDef *usart = config->usart;
	struct uart_stm32_data *data = dev->data;
	struct uart_event disabled_event = {
		.type = UART_RX_DISABLED
	};

	if (!data->dma_rx.enabled) {
		async_user_callback(data, &disabled_event);
		return -EFAULT;
	}

#if HAS_RTO
	if (LL_USART_IsEnabledIT_RTO(usart)) {
		LL_USART_DisableIT_RTO(usart);
	} else {
		LL_USART_DisableIT_IDLE(usart);
	}
#else  /* HAS_RTO */
	LL_USART_DisableIT_IDLE(usart);
#endif /* HAS_RTO */

	/* Disable error interrupt to prevent spurious ISRs when async RX is disabled */
	LL_USART_DisableIT_ERROR(usart);

