zephyrproject-rtos/zephyr/drivers/serial/uart_stm32.c
		if (dma_start(data->dma_tx.dma_dev, data->dma_tx.dma_channel)) {
			LOG_ERR("UART err: TX DMA start failed!");
			return -EFAULT;
		}

		/* Start TX timer */
		async_timer_start(&data->dma_tx.timeout_work, data->dma_tx.timeout);
	}

#ifdef CONFIG_PM

	/* Do not allow system to suspend until transmission has completed */
	uart_stm32_pm_policy_state_lock_get_unconditional();
#endif

	if (IS_ENABLED(CONFIG_UART_STM32U5_ERRATA_DMAT_LOWPOWER)) {
		/**
		 * Send first character using polling.
		 * The DMA TX needs to be enabled before the UART transmits
		 * the character and triggers transfer complete event.
		 */
		key = irq_lock();

		if (char_size > 1) {
			LL_USART_TransmitData9(usart, *(const uint16_t *)tx_data);
		} else {
			LL_USART_TransmitData8(usart, *tx_data);
		}

		if (data->dma_tx.buffer_length > char_size) {
			/* Enable TX DMA requests */
			uart_stm32_dma_tx_enable(dev);
		}

		irq_unlock(key);
	} else {
		/* Enable TX DMA requests */
		uart_stm32_dma_tx_enable(dev);
	}

	return 0;
}

static void set_timeout_itr(USART_TypeDef *usart, uint32_t baudrate, int32_t timeout)
{
#if HAS_RTO
#if HAS_LPUART
	if (IS_LPUART_INSTANCE(usart)) {
		goto enable_idle_itr;
	}
#endif

	if (LL_USART_IsEnabledIT_RTO(usart)) {
		LL_USART_DisableRxTimeout(usart);
		LL_USART_DisableIT_RTO(usart);
		LL_USART_ClearFlag_RTO(usart);
	} else {
		LL_USART_DisableIT_IDLE(usart);
		LL_USART_ClearFlag_IDLE(usart);
	}

	if (timeout == SYS_FOREVER_US) {
		goto enable_idle_itr;
	}

	/* Cast to uint64_t to avoid overflowing before the division */
	uint64_t timeout_in_bits = ((uint64_t)timeout * baudrate) / 1000000;

	if (timeout_in_bits > UINT32_MAX) {
		goto enable_idle_itr;
	}

	/* Not all UARTs support hardware RX timeouts.
	 * Try to set the timeout anyway, and see if it gets set.
	 * Ref RM, "USART receiver timeout register (USART_RTOR):
	 * "This register is reserved and forced by hardware to "0x00000000"
	 * when the Receiver timeout feature is not supported."
	 * This also falls back to using the IDLE interrupt
	 * if the timeout requested is too short or 0.
	 */
	LL_USART_SetRxTimeout(usart, (uint32_t)timeout_in_bits);
	if (LL_USART_GetRxTimeout(usart) == 0) {
		goto enable_idle_itr;
	}

	/* Use hardware RTO interrupt */
	LOG_DBG("Set RTO timeout: %d us / %d bits", timeout, (uint32_t)timeout_in_bits);

	LL_USART_ClearFlag_RTO(usart);
	LL_USART_EnableIT_RTO(usart);
	LL_USART_EnableRxTimeout(usart);
	return;

enable_idle_itr:
#endif /* HAS_RTO */

	LL_USART_ClearFlag_IDLE(usart);
	LL_USART_EnableIT_IDLE(usart);
}

static int uart_stm32_async_rx_enable(const struct device *dev,
		uint8_t *rx_buf, size_t buf_size, int32_t timeout)
{
	const struct uart_stm32_config *config = dev->config;
	USART_TypeDef *usart = config->usart;
	struct uart_stm32_data *data = dev->data;
	int ret;

	if (data->dma_rx.dma_dev == NULL) {
		return -ENODEV;
	}

	if (data->dma_rx.enabled) {
		LOG_WRN("RX was already enabled");
		return -EBUSY;
	}

	if (!stm32_buf_in_nocache((uintptr_t)rx_buf, buf_size)) {
		LOG_ERR("Rx buffer should be placed in a nocache memory region");
		return -EFAULT;
	}

	/* A cyclic DMA is tracked by where its write position has got to, which
	 * cannot tell a full lap apart from no progress at all. One byte leaves no
	 * room between those two, so the position never reports anything.
	 */
	if (data->dma_rx.dma_cfg.cyclic && buf_size < 2) {
		LOG_ERR("Rx buffer must hold at least 2 bytes in cyclic DMA mode");
		return -EINVAL;
	}

	data->dma_rx.offset = 0;
	data->dma_rx.buffer = rx_buf;
	data->dma_rx.buffer_length = buf_size;
	data->dma_rx.counter = 0;
	data->dma_rx.timeout = timeout;

	/* Disable RX interrupts to let DMA to handle it */
	ll_usart_irq_rx_disable(usart);

	data->dma_rx.blk_cfg.block_size = buf_size;
	data->dma_rx.blk_cfg.dest_address = (uint32_t)data->dma_rx.buffer;

	ret = dma_config(data->dma_rx.dma_dev, data->dma_rx.dma_channel, &data->dma_rx.dma_cfg);

	if (ret != 0) {
		LOG_ERR("UART ERR: RX DMA config failed!");
		return -EINVAL;
	}

	if (dma_start(data->dma_rx.dma_dev, data->dma_rx.dma_channel)) {
		LOG_ERR("UART ERR: RX DMA start failed!");
		return -EFAULT;
	}

	/* Flush RX data buffer */
#ifdef USART_SR_RXNE
	LL_USART_ClearFlag_RXNE(usart);
#else
	LL_USART_RequestRxDataFlush(usart);
#endif /* USART_SR_RXNE */

	/* Enable RX DMA requests */
	uart_stm32_dma_rx_enable(dev);

	set_timeout_itr(usart, data->uart_cfg->baudrate, timeout);

	LL_USART_EnableIT_ERROR(usart);

	/* Request next buffer */
	async_evt_rx_buf_request(data);

#if defined(CONFIG_UART_STM32_ABNORMAL_RTS_ERRATUM_WORKAROUND)
	if (config->rts_gpio.port != NULL) {
		gpio_pin_set_dt(&config->rts_gpio, 1);
	}
#endif

	LOG_DBG("async rx enabled");

	return ret;
}

static int uart_stm32_async_tx_abort(const struct device *dev)
{
	struct uart_stm32_data *data = dev->data;
	size_t tx_buffer_length = data->dma_tx.buffer_length;
	struct dma_status stat;

	if (tx_buffer_length == 0) {
		return -EFAULT;
	}

	(void)k_work_cancel_delayable(&data->dma_tx.timeout_work);
	if (!dma_get_status(data->dma_tx.dma_dev,
				data->dma_tx.dma_channel, &stat)) {
		data->dma_tx.counter = tx_buffer_length - stat.pending_length;
	}

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32u5_dma)
	dma_suspend(data->dma_tx.dma_dev, data->dma_tx.dma_channel);
#endif
	dma_stop(data->dma_tx.dma_dev, data->dma_tx.dma_channel);
	async_evt_tx_abort(data);

	return 0;
}

static void uart_stm32_async_rx_timeout(struct k_work *work)
{
	struct k_work_delayable *dwork = k_work_delayable_from_work(work);
	struct uart_dma_stream *rx_stream = CONTAINER_OF(dwork,
			struct uart_dma_stream, timeout_work);
	struct uart_stm32_data *data = CONTAINER_OF(rx_stream,
			struct uart_stm32_data, dma_rx);
	const struct device *dev = data->uart_dev;

	LOG_DBG("rx timeout");

	/* The DMA is still active and could trigger an interrupt
	 * while we are processing this timeout, which could cause
	 * data corruption when the DMA ISR modifies shared data
	 * as we are operating on it. Prevent data race with ISR by
	 * masking all interrupts until we're done.
	 */
	unsigned int key = irq_lock();

	/* When cyclic DMA is used, do not disable the RX on timeout */
	if (data->dma_rx.dma_cfg.cyclic == 0 &&
	    data->dma_rx.counter == data->dma_rx.buffer_length) {
		uart_stm32_async_rx_disable(dev);
	} else {
		uart_stm32_dma_rx_flush(dev);
	}

	irq_unlock(key);
}

static void uart_stm32_async_tx_timeout(struct k_work *work)
{
	struct k_work_delayable *dwork = k_work_delayable_from_work(work);
	struct uart_dma_stream *tx_stream = CONTAINER_OF(dwork,
			struct uart_dma_stream, timeout_work);
	struct uart_stm32_data *data = CONTAINER_OF(tx_stream,
			struct uart_stm32_data, dma_tx);
	const struct device *dev = data->uart_dev;

	uart_stm32_async_tx_abort(dev);

