zephyrproject-rtos/zephyr/drivers/serial/uart_stm32.c
	return 0;
}
#endif /* CONFIG_PM_DEVICE */

#ifdef CONFIG_UART_ASYNC_API
/* src_dev and dest_dev should be 'MEMORY' or 'PERIPHERAL'. */
#define UART_DMA_CHANNEL_INIT(index, dir, dir_cap, src_dev, dest_dev)	\
	.dma_dev = DEVICE_DT_GET(STM32_DT_INST_DMA_CTLR(index, dir)),	\
	.dma_channel = DT_INST_DMAS_CELL_BY_NAME(index, dir, channel),	\
	.dma_cfg = {							\
		.dma_slot = STM32_DT_INST_DMA_SLOT(index, dir),		\
		.channel_direction = STM32_DMA_CONFIG_DIRECTION(	\
			STM32_DT_INST_DMA_CHANNEL_CONFIG(index, dir)),	\
		.cyclic =  STM32_DMA_CONFIG_CYCLIC(			\
			STM32_DT_INST_DMA_CHANNEL_CONFIG(index, dir)),  \
		.channel_priority = STM32_DMA_CONFIG_PRIORITY(		\
			STM32_DT_INST_DMA_CHANNEL_CONFIG(index, dir)),	\
		.source_data_size = STM32_DMA_CONFIG_##src_dev##_DATA_SIZE(\
			STM32_DT_INST_DMA_CHANNEL_CONFIG(index, dir)),	\
		.dest_data_size = STM32_DMA_CONFIG_##dest_dev##_DATA_SIZE(\
			STM32_DT_INST_DMA_CHANNEL_CONFIG(index, dir)),	\
		/* single transfers (burst length = data size) */	\
		.source_burst_length = STM32_DMA_CONFIG_##src_dev##_DATA_SIZE(\
			STM32_DT_INST_DMA_CHANNEL_CONFIG(index, dir)),	\
		.dest_burst_length = STM32_DMA_CONFIG_##dest_dev##_DATA_SIZE(\
			STM32_DT_INST_DMA_CHANNEL_CONFIG(index, dir)),	\
		.block_count = 1,					\
		.dma_callback = uart_stm32_dma_##dir##_cb,		\
	},								\
	.src_addr_increment = STM32_DMA_CONFIG_##src_dev##_ADDR_INC(	\
		STM32_DT_INST_DMA_CHANNEL_CONFIG(index, dir)),		\
	.dst_addr_increment = STM32_DMA_CONFIG_##dest_dev##_ADDR_INC(	\
		STM32_DT_INST_DMA_CHANNEL_CONFIG(index, dir)),		\
	.fifo_threshold = STM32_DMA_FEATURES_FIFO_THRESHOLD(		\
		STM32_DT_INST_DMA_FEATURES(index, dir)),
#endif /* CONFIG_UART_ASYNC_API */

#if defined(CONFIG_UART_INTERRUPT_DRIVEN) || defined(CONFIG_UART_ASYNC_API) || defined(CONFIG_PM)
#define STM32_UART_IRQ_HANDLER_DEFINE(index)					\
	static void uart_stm32_irq_config_func_##index(const struct device *dev)\
	{									\
		IRQ_CONNECT(DT_INST_IRQN(index), DT_INST_IRQ(index, priority),	\
			    uart_stm32_isr, DEVICE_DT_INST_GET(index), 0);	\
		irq_enable(DT_INST_IRQN(index));				\
	}

#define STM32_UART_IRQ_HANDLER_FUNC(index)					\
	.irq_config_func = uart_stm32_irq_config_func_##index,

/*
 * Detect at build time if multiple enabled UART instances share the same IRQ
 * number (common on STM32G0, STM32F0, and similar series with limited NVIC
 * lines). When sharing is detected, CONFIG_SHARED_INTERRUPTS must be enabled
 * so gen_isr_tables can wire up z_shared_isr to dispatch to each driver ISR.
 * This could be detected and reported by gen_isr_table with a user-friendly
 * error message but is not done today. This should be dropped when a more
 * generic solution is implemented at gen_isr_table level.
 */
#define STM32_UART_COUNT_MATCHING_IRQ(inst, irq_num)				\
	+ ((DT_INST_IRQN(inst) == (irq_num)) ? 1 : 0)

#define STM32_UART_CHECK_SHARED_IRQ(index)					\
	BUILD_ASSERT(								\
		(0 DT_INST_FOREACH_STATUS_OKAY_VARGS(				\
			STM32_UART_COUNT_MATCHING_IRQ,				\
			DT_INST_IRQN(index))) <= 1 ||				\
		IS_ENABLED(CONFIG_SHARED_INTERRUPTS),				\
		"Node " DT_NODE_PATH(DT_DRV_INST(index))			\
		" shares its interrupt line with another "			\
		"st,stm32-uart instance: "					\
		"enable CONFIG_SHARED_INTERRUPTS");

#else
#define STM32_UART_IRQ_HANDLER_DEFINE(index) /* Not used */
#define STM32_UART_IRQ_HANDLER_FUNC(index) /* Not used */
#define STM32_UART_CHECK_SHARED_IRQ(index) /* Not used */
#endif /* CONFIG_UART_INTERRUPT_DRIVEN || CONFIG_UART_ASYNC_API || CONFIG_PM */

#ifdef CONFIG_UART_ASYNC_API
#define UART_DMA_CHANNEL(index, dir, DIR, src, dest)				\
	.dma_##dir = {								\
		COND_CODE_1(DT_INST_DMAS_HAS_NAME(index, dir),			\
			 (UART_DMA_CHANNEL_INIT(index, dir, DIR, src, dest)),	\
			 (NULL))						\
	},
#else
#define UART_DMA_CHANNEL(index, dir, DIR, src, dest)
#endif

#ifdef CONFIG_PM
#define STM32_UART_PM_WAKEUP(index)						\
	.wakeup_source = DT_INST_PROP(index, wakeup_source),			\
	.wakeup_line = DT_INST_PROP_OR(index, wakeup_line, STM32_WAKEUP_LINE_NONE),
#else
#define STM32_UART_PM_WAKEUP(index) /* Not used */
#endif

#if defined(CONFIG_UART_STM32_ABNORMAL_RTS_ERRATUM_WORKAROUND)
#define STM32_UART_RTS_GPIO(index)						\
	.rts_gpio = GPIO_DT_SPEC_INST_GET_OR(index, st_sw_rts_gpios, {0}),
#define STM32_UART_CHECK_DT_RTS_GPIO(index)					\
	BUILD_ASSERT(!DT_INST_NODE_HAS_PROP(index, st_sw_rts_gpios) ||		\
		     DT_INST_PROP(index, hw_flow_control),			\
		     "Node " DT_NODE_PATH(DT_DRV_INST(index))			\
		     " 'st,sw-rts-gpios' requires 'hw-flow-control' to be enabled");
#else
#define STM32_UART_RTS_GPIO(index) /* Not used */
#define STM32_UART_CHECK_DT_RTS_GPIO(index)
#endif

/* Ensure DTS doesn't present an incompatible parity configuration.
 * Mark/space parity isn't supported on the STM32 family.
 * If 9 data bits are configured, ensure that a parity bit isn't set.
 */
#define STM32_UART_CHECK_DT_PARITY(index)					\
	BUILD_ASSERT(								\
		!(DT_INST_ENUM_IDX(index, parity) == UART_CFG_PARITY_MARK ||	\
		DT_INST_ENUM_IDX(index, parity) == UART_CFG_PARITY_SPACE),	\
		"Node " DT_NODE_PATH(DT_DRV_INST(index))			\
		" has unsupported parity configuration");			\
	BUILD_ASSERT(								\
		!(DT_INST_ENUM_IDX(index, parity) != UART_CFG_PARITY_NONE &&	\
		DT_INST_ENUM_IDX(index, data_bits) == UART_CFG_DATA_BITS_9),	\
		"Node " DT_NODE_PATH(DT_DRV_INST(index))			\
		" has unsupported parity + data bits combination");

/* Ensure DTS doesn't present an incompatible data bits configuration
 * The STM32 family doesn't support 5 data bits, or 6 data bits without parity.
 * Only some series support 7 data bits.
 */
#ifdef STM32_USART_DATAWIDTH_7_BIT
#define STM32_UART_CHECK_DT_DATA_BITS(index)					\
	BUILD_ASSERT(								\
		!(DT_INST_ENUM_IDX(index, data_bits) == UART_CFG_DATA_BITS_5 ||	\
		(DT_INST_ENUM_IDX(index, data_bits) == UART_CFG_DATA_BITS_6 &&	\
		DT_INST_ENUM_IDX(index, parity) == UART_CFG_PARITY_NONE)),	\
		"Node " DT_NODE_PATH(DT_DRV_INST(index))			\
			" has unsupported data bits configuration");
#else
#define STM32_UART_CHECK_DT_DATA_BITS(index)					\
	BUILD_ASSERT(								\
		!(DT_INST_ENUM_IDX(index, data_bits) == UART_CFG_DATA_BITS_5 ||	\
		DT_INST_ENUM_IDX(index, data_bits) == UART_CFG_DATA_BITS_6 ||	\
		(DT_INST_ENUM_IDX(index, data_bits) == UART_CFG_DATA_BITS_7 &&	\
		DT_INST_ENUM_IDX(index, parity) == UART_CFG_PARITY_NONE)),	\
		"Node " DT_NODE_PATH(DT_DRV_INST(index))			\
		" has unsupported data bits configuration");
#endif

/* Ensure DTS doesn't present an incompatible stop bits configuration.
 * Some STM32 series USARTs don't support 0.5 stop bits, and it generally isn't
 * supported for LPUART.
 */
#ifndef STM32_USART_STOP_BIT_0_5
#define STM32_UART_CHECK_DT_STOP_BITS_0_5(index)				\
	BUILD_ASSERT(								\
		DT_INST_ENUM_IDX(index, stop_bits) != UART_CFG_STOP_BITS_0_5,	\
		"Node " DT_NODE_PATH(DT_DRV_INST(index))			\
		" has unsupported stop bits configuration");
/* LPUARTs don't support 0.5 stop bits configurations */
#else
#define STM32_UART_CHECK_DT_STOP_BITS_0_5(index)				\
	BUILD_ASSERT(								\
		!(DT_HAS_COMPAT_STATUS_OKAY(st_stm32_lpuart) &&			\
		DT_INST_ENUM_IDX(index, stop_bits) == UART_CFG_STOP_BITS_0_5),	\
		"Node " DT_NODE_PATH(DT_DRV_INST(index))			\
		" has unsupported stop bits configuration");
#endif

/* Ensure DTS doesn't present an incompatible stop bits configuration.
 * Some STM32 series USARTs don't support 1.5 stop bits, and it generally isn't
 * supported for LPUART.
 */
#ifndef STM32_USART_STOP_BIT_1_5
#define STM32_UART_CHECK_DT_STOP_BITS_1_5(index)				\
	BUILD_ASSERT(								\
		DT_INST_ENUM_IDX(index, stop_bits) != UART_CFG_STOP_BITS_1_5,	\
		"Node " DT_NODE_PATH(DT_DRV_INST(index))			\
		" has unsupported stop bits configuration");
/* LPUARTs don't support 1.5 stop bits configurations */
#else
#define STM32_UART_CHECK_DT_STOP_BITS_1_5(index)				\
	BUILD_ASSERT(								\
		!(DT_HAS_COMPAT_STATUS_OKAY(st_stm32_lpuart) &&			\
		DT_INST_ENUM_IDX(index, stop_bits) == UART_CFG_STOP_BITS_1_5),	\
		"Node " DT_NODE_PATH(DT_DRV_INST(index))			\
		" has unsupported stop bits configuration");
#endif

#define STM32_UART_INIT(index)							\
	STM32_UART_IRQ_HANDLER_DEFINE(index)					\
										\
	PINCTRL_DT_INST_DEFINE(index);						\
										\
	static const struct stm32_pclken pclken_##index[] =			\
		STM32_DT_INST_CLOCKS(index);					\
										\
	static struct uart_config uart_cfg_##index = {				\
		.baudrate = DT_INST_PROP(index, current_speed),			\
		.parity = DT_INST_ENUM_IDX(index, parity),			\
		.stop_bits = DT_INST_ENUM_IDX(index, stop_bits),		\
		.data_bits = DT_INST_ENUM_IDX(index, data_bits),		\
		.flow_ctrl = DT_INST_PROP(index, hw_flow_control)		\
					? UART_CFG_FLOW_CTRL_RTS_CTS		\
					: UART_CFG_FLOW_CTRL_NONE,		\
	};									\
										\
	static const struct uart_stm32_config uart_stm32_cfg_##index = {	\
		.usart = (USART_TypeDef *)DT_INST_REG_ADDR(index),		\
		.clock = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),		\
		.reset = RESET_DT_SPEC_GET(DT_DRV_INST(index)),			\
		.pclken = pclken_##index,					\
		.pclk_len = DT_INST_NUM_CLOCKS(index),				\
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(index),			\
		.single_wire = DT_INST_PROP(index, single_wire),		\
		.tx_rx_swap = DT_INST_PROP(index, tx_rx_swap),			\
		.rx_invert = DT_INST_PROP(index, rx_invert),			\
		.tx_invert = DT_INST_PROP(index, tx_invert),			\
		.de_enable = DT_INST_PROP(index, de_enable),			\
		.de_assert_time = DT_INST_PROP(index, de_assert_time),		\
		.de_deassert_time = DT_INST_PROP(index, de_deassert_time),	\
		.de_invert = DT_INST_PROP(index, de_invert),			\
		.fifo_enable = DT_INST_PROP(index, fifo_enable),		\
		STM32_UART_RTS_GPIO(index)					\
		STM32_UART_IRQ_HANDLER_FUNC(index)				\
		STM32_UART_PM_WAKEUP(index)					\
	};									\
										\
	static struct uart_stm32_data uart_stm32_data_##index = {		\
		.uart_cfg = &uart_cfg_##index,					\
		UART_DMA_CHANNEL(index, rx, RX, PERIPHERAL, MEMORY)		\
		UART_DMA_CHANNEL(index, tx, TX, MEMORY, PERIPHERAL)		\
	};									\
										\
	PM_DEVICE_DT_INST_DEFINE(index, uart_stm32_pm_action);			\
										\
	DEVICE_DT_INST_DEFINE(index,						\
			      uart_stm32_init,					\
			      PM_DEVICE_DT_INST_GET(index),			\
			      &uart_stm32_data_##index, &uart_stm32_cfg_##index,\
			      PRE_KERNEL_1, CONFIG_SERIAL_INIT_PRIORITY,	\
			      &uart_stm32_driver_api);				\
										\
	STM32_UART_CHECK_DT_PARITY(index)					\
	STM32_UART_CHECK_DT_DATA_BITS(index)					\
	STM32_UART_CHECK_DT_STOP_BITS_0_5(index)				\
	STM32_UART_CHECK_DT_STOP_BITS_1_5(index)				\
	STM32_UART_CHECK_SHARED_IRQ(index)					\
	STM32_UART_CHECK_DT_RTS_GPIO(index)

DT_INST_FOREACH_STATUS_OKAY(STM32_UART_INIT)
